namespace Maybe2
{
    public static class Re
    {

        public const string fio = @"^([\ ]*[ёа - яЁА - Я]+[ёа-яЁА-Я\ ]*[ёа - яЁА - Я\-ёа - яЁА - Я]?[ёа-яЁА-Я\ ]*[ёа - яЁА - Я]+[\ ]*)$";
        public const string phone = @"((\+?\d)\s?)?\(?(\d\d\d)\)?\s?(\d\d\d)(\s|-)?(\d\d)(\s|-)?(\d\d)";
        public const string birthdate = @"^(0?[1-9]|[12][0-9]|3[01])[\.](0?[1-9]|1[012])[\.][12]\d{3}";
        public const string date = @"(0?[1-9]|[12][0-9]|3[01])[\.](0?[1-9]|1[012])[\.][12]\d{3}";
        public const string date_us = @"^[12]\d{3}[\-](0?[1-9]|1[012])[\-](0?[1-9]|[12][0-9]|3[01])";
        //^([\w\.\-]+)@([\w\-]+)((\.(\w){2,3})+)$
        public const string email = @"^(([^<>()\[\]\.,;:\s@\']+(\.[^<>()\[\]\.,;:\s@\']+)*)|(\'.+\'))@(([^<>()[\]\.,;:\s@\']+\.)+[^<>()[\]\.,;:\s@\']{2,})$";
    }
}
